# 5) Пользователь вводит число N. Создать массив размера N, который одинаково читается как слева направо, так и справа налево.


N=int(input())
M=[]
for i in range (N):
    M.append(1)
print(M)




