# 1. Реализовать классы: фигура, круг, прямоугольник, квадрат. Классы должны предоставлять методы:
# - получение центра
# - получение периметра
# - получение площади
# 2. Реализовать класс(ы) для работы с карточной колодой, который предоставляет методы:
# - инициализация заданным числом карт (36 или 52)
# - получение карты (карта должна пропадать из колоды после того, как была получена)
# - сравнение двух карт (при это учесть, что туз > король > дама > валет > числовые карты)
# - получение оставшегося числа карт в колоде
# Не забыть про то, что каждая карта имеет масть.
# 3. Реализовать класс для работы со списком дел, который предоставляет методы:
# - добавить дело
# - просмотреть список дел
# - удалить дело с номером n
# - просмотреть дело с номером n
# - поставить дело с номером m на позицию n
# 4. Написать класс, который бы по всем внешним признакам был бы словарем, но позволял обращаться к ключам как к атрибутам
import math
#
# class Figura:
#     def __init__(self):

        # try:
        #     val = input()
        #     ints = val.split(',')
        #     res = [int(i) for i in ints]
        # except ValueError:
        #     print('Это не число.')
        # except Exception:
        #     print('Не верный входной формат')
        # else:
        #     print('Всё хорошо.')
        # finally:
        #     print('В любом случаи доходим до сюда')

# # class Main:
# #     if n
# class Rectangle:
#     def __init__(self, width=0, height=0):
#         self.width = width
#         self.height = height
#
#     def area(self):
#         return self.width * self.height
#
#     def perimeter(self):
#         return 2 * self.height + 2 * self.width
#
#
# a = int(input("Введите одну длинну стороны прямоугольника:  "))
# b = int(input("Введите другую длинну стороны прямоугольника:  "))
# z = Rectangle.perimeter
# print (z)
# x= Rectangle.area
# print(x)
#
# main()







